[
{"file_urls": ["https://en.softonic.com/download/free-launch-bar/post-download?sl=1"], "images": [], "files": [{"url": "https://en.softonic.com/download/free-launch-bar/post-download?sl=1", "checksum": "189065571b17ac45775aae6040ac57ee", "path": "full/433a2f2b4ead1592ffc329ee85fa3186c80f4166"}]},
{"file_urls": ["https://en.softonic.com/download/conceptdraw/post-download?sl=1"], "images": [], "files": [{"url": "https://en.softonic.com/download/conceptdraw/post-download?sl=1", "checksum": "f02c56021f634d78c55f5a112a75d237", "path": "full/06025145c9fad8a7892257e409ad18573c542110"}]},
{"description": "'Mixing teen drama, ghosts, and time-travel, Oxenfree makes for a beautiful - if at times chilling - adventure. Its beautiful 2D art creates a storybook world for a tale that has you questioning what is right, what you want, and what is real. Scream Like any teen horror movie, Oxenfree begins with a group young adults voluntarily stranding themselves overnight on an island. It’s an odd thing to do at the best of times, but it seems even stranger here as the relationship between the five is at best… strained. You play as Alex, a girl who recently lost her brother to drowning. With you on this trip, you have your new step brother, Jonas; your neurotic stoner best friend, Ren; your brothers ex, Clarissa; and her best friend, Nona… who Ren fancies. Perfect. Soon after beginning you find yourself on a beach. The dynamics are like a powder keg – and with Clarissa throwing lit matches where ever she can, the situation soon blows up. These opening moments set the scene and establish the dynamics between the characters. You use the intuitive controls to pick between responses to questions and join in with conversations. This system drives many of your discoveries - both of the people and the world - and also impacts the way the story plays out. Loop Looking for a way to escape from Clarissa, you and Jonas break off from the group to explore a cave, which is where things start to get… freaky. In the caves you find an odd disturbance that you can tune into with your radio. Cryptic messages start to pour through and within moments everything goes wrong. From here you are plunged into a cryptic horror story, filled with time loops that have you reliving events - albethey slightly altered. These changes begin unnervingly, but quickly become devastating. You repeatedly witness your friends die, only to reappear in seconds possessed and with glowing eyes. It is chilling, which is impressive considering the comic 2D look. The creepy voices of the voices on the radio send shivers down your spine as they cycle through stations to communicate. This while watching the gang of teens seemingly die over and over becomes affecting. This is all, in no small part, down to the voice acting. While their tiny forms manage to inject personality with their animation, this is nothing compared to how much emotion their voices convey. Happiness, horror, and relief are all believable – as is the panic as they see friends drop from windows. Olly olly oxen free Oxenfree offers more moment-to-moment control than many interactive narratives. But, while you control all of the action from its stunning 2D perspective, the focus here is a slow exploration – both of the environment and the interaction between characters. Everything here hinges on narrative, and Oxenfree does not disappoint.'", "title": "'Oxenfree '", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-01-700x327.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-02-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-03-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-04-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-05-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-06-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-07-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-08-700x393.jpg"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-01-700x327.jpg", "checksum": "18e70cda164428a3940ace64d1ca6e08", "path": "full/de1d3effe07d7ce18fb211370cbb9b2ed2307ad9.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-02-700x393.jpg", "checksum": "22c0d2be0f12c2e84de4b383d0b72643", "path": "full/4ed930434d112abc1fb3494f07ab863359ffb54a.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-03-700x393.jpg", "checksum": "4eff83df1c7f5cf4bf710f8d8900c084", "path": "full/2a305688aaa589cb60d3cc65d0e09850f245bdfb.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-04-700x393.jpg", "checksum": "af3b748e3643baf4cf7280e1f02a1971", "path": "full/5027d68e9909bd6c8bb131351334a2d9943f32ed.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-05-700x393.jpg", "checksum": "fb0d2ea15650b01d37288fafba9fbc72", "path": "full/dc39ef7439827a045bf9d91a7dfeaa9a2e71654e.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-06-700x393.jpg", "checksum": "0cab5f4bc3403f4141778199bc016139", "path": "full/e41bc8ece57d769232b62db9e44efc57aac78c44.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-07-700x393.jpg", "checksum": "228e0edf896cca9778c900f59b72f3e6", "path": "full/b4f3287e1473f10a8e522ffa660d2e5a88a89312.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69717000/69717253/oxenfree-08-700x393.jpg", "checksum": "4d0d627ce9b9f57f570f9025751433d8", "path": "full/54c65a47aad6853f266c33e629841cbe36bae55e.jpg"}], "os": "'Windows 7'", "files": []},
{"description": "\"Photoscape is an amazing free photo editor. It includes so many filters, tools and special effects you'll find it hard to believe it's actually free. Full of features Photoscape includes just about everything you need to view, optimize, edit, print and have fun with your photos. In fact, it's so complete that many would call it a free Photoshop alternative. Sure, it's not quite up to the level of Photoshop, but it's truly a great alternative to Adobe's big shot - and it makes photo editing a lot more fun! Easy to use From the program's main window you can choose what you want to do: view pictures, optimize those that didn't come out so well, print several photos on a single page collage-style or perhaps add any of the dozens of filters and special effects included in the program. Smart interface One of the first striking elements in Photoscape is its uncommon interface design. The application is very striking and in many ways it's easier on the eye than Photoshop. Conclusion There's really nothing negative to say about Photoscape. Just download it, test it, love it and keep it forever. It's free! Changes Supports 34 languages Added Clone Stamp (Editor -> Tools Tab) video Added Paint Brush (Editor -> Tools Tab) Added Color Picker (Editor -> Tools Tab & Object Tab) Improved Mosaic Filter: Mosaic pixel size selectable (Editor -> Tools Tab) Changed Editor -> Region tab name from 'Region' to 'Tools'. Added 'Print Button' to Viewer and Editor. Added 59 travel icons, 7 face icons and 6 makeup icons. Photo Development Service with FOTO.COM (EU Only) At combine, the first photo's EXIF information would be saved. Photo viewer shows photos in regular sequence (a1, a10, a2, a3 -> a1, a2, a3, a10) Run 'Raw Converter' automatically when you drag & drop at the Photoscape welcome screen. Support Windows Vista, Windows 7. Support Multiuser Sessions. Stop supporting Window 95, 98 and Me. (If you are a user of Windows 98 or Me, please use Photoscape 3.4) Fixed minor bugs.\"", "title": "'Photoscape  3.7'", "image_urls": ["https://screenshots.en.sftcdn.net/ven/0/209/photoscape-overview-21072011-en_img350.jpg", "https://screenshots.en.sftcdn.net/ven/12000/12451/photoscape-tutorials-11052012-en_img350.jpg", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-01-700x481.png", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-02-635x535.png", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-03-700x519.png", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-04-700x527.png", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-05-700x301.png", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-06-700x521.png", "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-07-542x535.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/ven/0/209/photoscape-overview-21072011-en_img350.jpg", "checksum": "3eda7439033e429f382151c3b5dd9f5b", "path": "full/c8d236640af695555033514c981daa9c3d24196f.jpg"}, {"url": "https://screenshots.en.sftcdn.net/ven/12000/12451/photoscape-tutorials-11052012-en_img350.jpg", "checksum": "15538e23e520f5a39d0ce93521da2418", "path": "full/682c30faab9d696605cec5350fd2beb231be0832.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-01-700x481.png", "checksum": "0d82c0ec8f772fcce8c3a368604dafbb", "path": "full/d1f5fc6adb9bd80cca96b01b0d6b0ae6cf676a55.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-02-635x535.png", "checksum": "06145cc2b550e1a3bed2fe78dfd584d6", "path": "full/f27c96f7bd8ad288c08a44390f403024b977965e.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-03-700x519.png", "checksum": "8045bfc2d91f70007738dde80f18f050", "path": "full/d7f878134a7d0f1b7a7f7ddc4c0868b5e9ec72ae.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-04-700x527.png", "checksum": "e5e9444a4ff945f27a47608aec89ff6c", "path": "full/ed897de58e226303d76f63f6d4db1cb63fb65021.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-05-700x301.png", "checksum": "9ac1bd13cf4fd1e6d3f1fc4707493270", "path": "full/ee06238c9f97e21388cef8cda038d58ffb097652.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-06-700x521.png", "checksum": "0a4f4d053dd8895213662f795e8bed9c", "path": "full/28f19b65fb0eba903055ad7cc11609c0b4f2b509.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/63000/63689/photoscape-07-542x535.png", "checksum": "2dc22e738a059362ad66377125d87bbb", "path": "full/994f5db2a5ca8b8ef32ff149446e6e63f197ca3f.jpg"}], "os": "'Windows 2000'", "files": []},
{"file_urls": ["https://en.softonic.com/download/vlc-media-player/post-download?sl=1"], "images": [], "files": [{"url": "https://en.softonic.com/download/vlc-media-player/post-download?sl=1", "checksum": "7460ceb477770b212755e7eafd8aaac0", "path": "full/b67f5115baf024e324ffbe3811a1963d7ae865db"}]},
{"description": "\"Mozilla Firefox is a free, open-source web browser that offers numerous features and customization options. Its performance is excellent, and it's designed to protect your privacy. All the features that you need \\xa0 Firefox includes several built-in features that can be extended through a vast catalog of extensions. It offers tabbed browsing customizable, the standard on all browsers now for quite some time. It also has an integrated search engine and is easily customizable. From the homepage, you'll have access to a Google search box and a list of shortcuts to access your downloads, bookmarks, history, add-ons, synchronization and settings. It has all the essential features and also includes a spell checker, built-in PDF reader, navigation with geotagging, and much more. As for security, there is a pop-up blocker, an anti-phishing filter, and features to protect your privacy, the cornerstone of Mozilla. In addition to the usual private browsing mode, Firefox gives you the option to block websites from tracking you, and can even tell you which websites you're being tracked by using the Lightbeam add-on. Firefox offers a system that ensures that the sites you visit are reliable, also verifying that your connection is secure. Security updates are automatic to ensure that you are always protected against the latest threats. It also provides some basic features, which are a spell checker, integrated PDF reader, navigation with geolocation, a reading mode to read without distractions, integration with Pocket and more. Highly customizable \\xa0 One of Firefox's biggest advantages is its ability to adapt to each user, made possible through the numerous customization options that allow you to organize the browser and tailor it to your needs - including the ability to allow your favorite sites to send you Push Notifications. Many themes are available for spicing up your Firefox interface, and you can organize your tools and most used features as you like in the menu or personal toolbar. Add-ons are also a great way to customize the browser and increase functionality. Some add-ons have become essential, such as Adblock Plus or Video DownloadHelper, which both have several million users. In addition, Firefox has Firefox Hello, an ephemeral chat room service, similar to Hangouts and based on the protocol WebRTC (so you will not need an additional plugin). With Firefox Hello you can also send the page you are visiting straight to your friends. Since version 35, Firefox allows access to its extension store Firefox Marketplace from the toolbar itself. One of the best browsers available \\xa0 There's a reason why Mozilla Firefox is one of the world's most popular web browsers. It's complete in terms of features, reliability and flexibility, and it offers everything you need for browsing the web in the smoothest way possible.\"", "title": "'Mozilla Firefox  54.0.1'", "image_urls": ["https://screenshots.en.sftcdn.net/ven/19000/19021/mozilla-firefox-overview-14042014-en_img350.jpg", "https://screenshots.en.sftcdn.net/ven/20000/20448/tips-24112015-en_img350.jpg", "https://screenshots.en.sftcdn.net/ven/19000/19740/opera-compare-29072014-en_img350.jpg", "https://screenshots.en.sftcdn.net/ven/19000/19741/opera-compare-29072014-en_img350.jpg", "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-10-535x535.png", "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-49-700x393.jpg", "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-55-700x530.png", "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-56-700x236.png", "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-57-700x530.png", "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-58-700x530.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/ven/19000/19021/mozilla-firefox-overview-14042014-en_img350.jpg", "checksum": "9c9af51960675b42fcd067c4f8cc9187", "path": "full/b1bbb07eb4622f34165a883d1f21e869bab81e5c.jpg"}, {"url": "https://screenshots.en.sftcdn.net/ven/20000/20448/tips-24112015-en_img350.jpg", "checksum": "3bcc71cd37c3d9dd2ae282392b634b96", "path": "full/3e805b83cdea175b961060ea148dfef9ba29ff58.jpg"}, {"url": "https://screenshots.en.sftcdn.net/ven/19000/19740/opera-compare-29072014-en_img350.jpg", "checksum": "3dfe7eb06a8436c90f1375305bb153d7", "path": "full/47f90f4913ff07f0048019c1b32d44678e675702.jpg"}, {"url": "https://screenshots.en.sftcdn.net/ven/19000/19741/opera-compare-29072014-en_img350.jpg", "checksum": "aefaf785112c82b64cac2b32f27c2c5f", "path": "full/72f3a456163d78ee5daf3c4038350838a53af06d.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-10-535x535.png", "checksum": "aaffddc3be7fe20d1d7da6bc6ceaa2ff", "path": "full/36c9ec7afa0e5be27875265a57d8b5a59355af73.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-49-700x393.jpg", "checksum": "c443d6f8283fbe9d54162cd6da15debf", "path": "full/da14c58511ba02f2fcbcad5cde7a98071334232a.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-55-700x530.png", "checksum": "73847244b815c5db3654cf7a977b820a", "path": "full/2889a0c79e560fb4e7e4d757b7629747dc4edcba.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-56-700x236.png", "checksum": "a937bc099ad025c6e4bc2b050bf25a10", "path": "full/38a8e696399ab730eb1247ebe0e6669dcc806646.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-57-700x530.png", "checksum": "d1f1df1d3e4fb271ad11c785cadb2856", "path": "full/ef110a392b828a5f7f4451468b49101cb296e8a8.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/107000/107191/mozilla-firefox-58-700x530.png", "checksum": "2e69c2f6f64b63f6bc9acb36e286dd41", "path": "full/0846b47c6a00edb154ef4c06fd9d3f0c5c6b4ba1.jpg"}], "os": "''", "files": []},
{"description": "\"Instagram lets you take photos and videos with your Android device, apply a few special effects and share them with family friends on its own social network - or via other social networks. What can you do with Instagram? You take your pictures, add a customized filter, and post it to Instagram’s community or through Twitter, Facebook, Foursquare or Tumblr. Through the Instagram app, you can give “likes” and give or receive comments on your pictures. Instagram has a Facebook-style feed, where you can view all the photos you upload, the people you follow, and even track specific places and hashtags to have a real-time look at what is going on. If this isn't enough to find what you want, you can also search photos by username, name, hashtag, or location. The best thing about Instagram are the filters included in the program. There are 27 to choose from (recently added are Lark, Reyes and Juno) with different color, brightness and lighting effects. If chosen wisely, you can obtain really awesome results. Each of these filters can now be customized using the photo editor (see What's New) which is incredibly intuitive. Instagram also includes support for videos, allowing you to capture up-to 15 seconds of footage to share via the Instagram network. As with photos, you can choose from a range of effects to apply to your videos to get them looking great. Instagram includes a photo and video messaging feature called Instagram Direct. It allows you to capture images and video then share them with Instagram friends. You can send messages via Instagram Direct to up-to 15 of your contacts at once. There is also an incredibly intuitive photo editor. It allows you to refine photos by adjusting aspects such as the sharpness, warmth, and brightness. You can also adjust the strength of the filters. For example, to change the 1977 filter, simply double-tap on it which will bring up a panel to adjust the photos. The service is very easy to use, and if you have many friends on Instagram it could be a more practical alternative to sending multimedia messages via other services like WhatsApp or Snapchat. Instagram has a People tab in Explore so you can find interesting people to follow, and curated collections of pictures selected by Instagram. You can also edit captions and change your locations, as well as search faster with predictive searches. Is Instagram complicated? The Instagram app is very easy to navigate. There are icons at the bottom of the interface which represent the different features of Instagram: the photo feed, photo/user search, photo capture, news feed (recent activity on the network from you and those you follow), and profile settings. When viewing pictures on your profile you can choose to display as a list or as a series of tiles for easy navigation. The presentation of the photos themselves in the photo feed is very clear, and likes and comments are shown underneath each picture. You can like or comment on a photo with a single click of an icon. However, it's a shame you can't open images full screen (i.e. you can only ever see them within the feed). Applying filters and retouching your photos in Instagram is very simple. You can snap an image through the app or choose one from your phone then view live previews of what each effect will look like. Get yourself on Instagram The Instagram app makes it easy to apply fun effects to your photos and share them with your friends. Although it requires you to sign-up to share images, the possibilities of what you can do with your pictures are vast.\"", "title": "'Instagram  Varies by device'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-01-300x535.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-02-300x535.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-03-300x535.jpg", "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-04-535x535.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-01-300x535.jpg", "checksum": "2848bb31a141e866ab31838b2e9ba644", "path": "full/5c494c86e5c029f0c3eed1d667b2a2cb336768ca.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-02-300x535.jpg", "checksum": "d61c1fdbd489dd87b4daa79e5744347d", "path": "full/eb219ac2138d02db3cd2a33154b4a149a4563846.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-03-300x535.jpg", "checksum": "e451c975cfa45448654e03ca4ce7b284", "path": "full/df436e107f9d61fd33149602fcf9e17b30fd001d.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/69728000/69728138/instagram-04-535x535.png", "checksum": "4b1a86787652bbc690d960e9de4dc075", "path": "full/14cbcac43497f3cb52b88d6dd146b816931bf621.jpg"}], "os": "'Windows 10'", "files": []},
{"description": "\"If you're looking for an alternative to MS Visio, you'll find that ConceptDraw PRO provides a competent alternative. ConceptDraw PRO is designed for professional flowcharting, diagramming and illustrating, and has almost all the tools you find in MS Visio. ConceptDraw PRO is very flexible and features a range of handy tools to help business and technical users quickly document complex structures, systems and processes. ConceptDraw PRO charts can be shared as a variety of graphics files and CAD documents, printed pages, presentations and web pages. The application is particularly suitable for charting tasks including business, IT, project, UML and network diagrams. There's also a built-in scripting language that allows users to build serious corporate visualization solutions. Probably the nearest competitor to ConceptDraw PRO is Omingraffle and while it isn't quite as intuitive as the latter, the Help section is extremely detailed and easy to follow. Most notably, ConceptDraw PRO offers tons of templates, including science, engineering, management, etc. Unfortunately, the developer still hasn't added an auto-save feature, and while importing Visio files is possible, the formatting is sometimes badly translated. Overall however, ConceptDraw PRO is a decent alternative to MS Visio if you've got the patience to stick with it. Changes “Action menu” button has been added to smart objects Content errors have been fixed in library objects, samples and help files New Libraries were added New Ribbon Interface Features added to content Lots of bugs fixed Stability greatly improved\"", "title": "'ConceptDraw PRO  10.2.0.62'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/98000/98940/5620c3497500escr_1444898670-700x508.png", "https://screenshots.en.sftcdn.net/en/scrn/98000/98940/conceptdraw-pro1412691013-700x467.png", "https://screenshots.en.sftcdn.net/en/scrn/98000/98940/conceptdraw-pro1412691021-694x535.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/98000/98940/5620c3497500escr_1444898670-700x508.png", "checksum": "4d624f00b02873a5e8301a34ca92c4b9", "path": "full/4e2e700e5a445bfa406be0336605cbfcaa08d8a7.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/98000/98940/conceptdraw-pro1412691013-700x467.png", "checksum": "88a31805e0755fda0065804b3b6259d4", "path": "full/351d74e9d30af3043ce8c3f226738524ec22923b.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/98000/98940/conceptdraw-pro1412691021-694x535.png", "checksum": "53bf078d3378aed47164ade9bef6e360", "path": "full/9c9bf09e5dd53f397a28acadb22f5da10e31aa95.jpg"}], "os": "'Windows 7'", "files": []},
{"description": "'Adblock Plus is the Chrome version of the hugely popular ad blocker for your browser. On the block When you are surfing the web, you’ll know how irritating ads can be. They flash, blink and generally get in the way. If you’re really unlucky, they can even be dangerous. Adblock Plus removes ads from the pages you are viewing, leaving a clean, peaceful white space in their wake. Adblock Plus works using filters. If certain elements are present on a page, the extension filters them out. There are several ready-made filters available, and you can choose however many you want from Adblock Plus’ settings menu. All blocked up If you are a little more technically-able, you’ll also be able to create your own filters, or mark previously-unfiltered items by right-clicking on them and choosing Block Element. This is made easier by the developer tools panel that shows blockable items along with applied filters. Under Adblock Plus’ settings options you’ll also be able to add certain websites to whitelists (to exempt them from blocking) and toggle a few other options. You’ll also see the Adblock Plus icon in the address bar, and by clicking it you’ll be able to enable and disable Adblock Plus in a single click. Been around the block If you’re bothered by ads while on the internet, try Adblock Plus. You won’t regret it.'", "title": "'Adblock Plus for Chrome  1.12.2'", "image_urls": ["https://screenshots.en.sftcdn.net/ven/18000/18339/adblock-plus-overview-27012014-en_img350.jpg", "https://screenshots.en.sftcdn.net/en/scrn/318000/318999/adblock-plus-for-chrome1408606251-700x479.png", "https://screenshots.en.sftcdn.net/en/scrn/318000/318999/adblock-plus-for-chrome1408606261-700x479.png", "https://screenshots.en.sftcdn.net/en/scrn/318000/318999/adblock-plus-for-chrome1408606268-700x479.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/ven/18000/18339/adblock-plus-overview-27012014-en_img350.jpg", "checksum": "e1a7a70834e84cc0866dfbaeff91eb51", "path": "full/31d981f483c4997b2acaeded1bb1fdcbcec432d6.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/318000/318999/adblock-plus-for-chrome1408606251-700x479.png", "checksum": "efad7c89d02e8bad93df10f9851d9bcd", "path": "full/0a9e267d01d5eaf1f0f8a613dadd9cd457b91538.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/318000/318999/adblock-plus-for-chrome1408606261-700x479.png", "checksum": "076c88244b75511ebe8926d289efa87d", "path": "full/c95a8a3a2626dd743d85532ba7f5bb20c4724bac.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/318000/318999/adblock-plus-for-chrome1408606268-700x479.png", "checksum": "6d94ac6a68643499a0e3cc98c45cd486", "path": "full/df01cd5bc595aab9fad8df2c2aad424e8ea25617.jpg"}], "os": "'Windows XP'", "files": []},
{"description": "''", "title": "'Eassos Recovery Free  4.0.1.258'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/6656000/6656221/scr_0-687x535.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/6656000/6656221/scr_0-687x535.png", "checksum": "2e193f079df6dbadea24c875d56c160b", "path": "full/4176003d7b57c0eac43e5c51c646d94d8c962e5b.jpg"}], "os": "'Windows 2000'", "files": []},
{"description": "''", "title": "'Network Drive Manager  2.2.0'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/53000/53171/network-drive-manager-3.jpg", "https://screenshots.en.sftcdn.net/en/scrn/53000/53171/network-drive-manager-11.jpg", "https://screenshots.en.sftcdn.net/en/scrn/53000/53171/network-drive-manager-13.jpg"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/53000/53171/network-drive-manager-3.jpg", "checksum": "fa600f165edfc8d445914a4671b99b8d", "path": "full/6bbbc8d7115d01d0e524234250af22ac0c9f839f.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/53000/53171/network-drive-manager-11.jpg", "checksum": "240f7acee1d160f0fd7fb522a6cba986", "path": "full/b1113f9c2c53d721b7ec1b541467911ce059b311.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/53000/53171/network-drive-manager-13.jpg", "checksum": "705f987b74d129968b47fd814e3f6caa", "path": "full/34937d0490c75a17fc6738eb5cbf659c16b87f7c.jpg"}], "os": "'Windows 98'", "files": []},
{"description": "'Virtual DJ is a virtual console for DJs. Despite the number of tools that it offers, it\\'s easy to use, and is the perfect midpoint between a consumer and professional product for DJing. All the best DJ tools Virtual DJ is great for mixing music, but its also the perfect program for remixes, thanks to an integrated sampler and effects. With the paid version, you can download a ton of tracks, which is great to replenish your musical arsenal. Virtual DJ has 5 different versions to suit the needs and capabilities of all types of users, from the absolute beginner, to the professional DJ. It offers a lot of independent decks (depending on which release you have), pitch control, EQ, effects, tone control algorithms, beat matching, beat lock engine, and dozens of other tools. Intuitive interface Virtual DJ is a console within your reach. Mixing music without a physical interface can become complicated, but there are many controllers on the market that are compatible with Virtual DJ. A few caveats , however, must be kept in mind: - With the LE version of Virtual DJ, you can only use the controller that was bundled - With the Home version, you can use any controller you want, but it will work only for 10 minutes per session. After this time, you will need to disconnect and reconnect it to the computer to use it again. The Pro Full version has no controller limitations of any kind. Choose the version suited to your needs If you already have a little practice with mixing, Virtual DJ Home is the perfect version for you. It\\'s free, but very well equipped, and is an ideal way to see if the program is the right one for you. If you are experienced, it might be a good idea to start with Virtual DJ LE, which is bundled with controllers and external sound cards for PCs and Macs. The limitations, compared to other editions, make it a good choice to learn the basics. Finally, there are three paid versions (Virtual DJ Broadcaster, Virtual DJ Pro Basic and Pro Full), which differ mainly in hardware support and control mapping. To study the exact differences between the five versions, you can consult the complete table on the Atomix site. A console suitable for anyone If you\\'re a DJ novice, Virtual DJ is the console to try. It\\'s a perfect example of quality combined with simplicity and completeness; it\\'s rare to find free DJ programs with so many features. Virtual DJ can also count on a very active community that revolves around the official forum. If you already have experience and are looking for alternatives, there are virtual consoles for DJs with any need. Quality, features, and ease of use are indicated \"only for professionals\" (Torq for example). If you come from the old school tradition and you\\'re used to mixing with analogue instruments, the most suitable alternative to switch to digital consoles could be MixVibes Cross DJ, which runs particularly well.'", "title": "'Virtual DJ  Free Home Edition  8.1.2857'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/36000/36948/3_skin_audio-700x525.jpg", "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/3_skin_audio.jpg", "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/virtual-dj-20.jpg", "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/virtual-dj-1.jpg", "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/virtual-dj-18.jpg"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/3_skin_audio-700x525.jpg", "checksum": "38decd330ec16cffdc2814d91115e460", "path": "full/25d9ea4903828376d8b534652435c4556a19ebe9.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/3_skin_audio.jpg", "checksum": "709ab9fcefd3dc38224d368e4f391c4d", "path": "full/49bac94ed377f522c066aee9151346e58e8522a7.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/virtual-dj-20.jpg", "checksum": "ea8305ad800b6810bdc93e5fcd8b4795", "path": "full/9d707adbc6de8132484ea1149e4662d4c8bde701.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/virtual-dj-1.jpg", "checksum": "fe9b5fa53a627bcd9e9282c41d776ad5", "path": "full/0031aa6d37f2d3ec510b512d78bcd7c0f5336102.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/36000/36948/virtual-dj-18.jpg", "checksum": "7e3d9aea9b42af0c9bf6f666c2ef4f91", "path": "full/a9e8825ac7fb5650eadb7fbe1b07f7bdc6e1b46f.jpg"}], "os": "'Windows XP'", "files": []},
{"file_urls": ["https://en.softonic.com/download/word-search-construction-kit/post-download?sl=1"], "images": [], "files": [{"url": "https://en.softonic.com/download/word-search-construction-kit/post-download?sl=1", "checksum": "5e6ef83f3057d42035b8df0a74dc5cc3", "path": "full/9bac32809c6e69ef4ceccd9c91e72e45472c3d09"}]},
{"description": "'Clementine music player is a is a lightweight, clean audio app for Windows, based on the popular Amarok engine for Linux. Just like iTunes, Clementine lets you build up a personal music library by importing files and folders from your hard drive. This means you can comfortably listen to all your music from one single location, even if it’s scattered all over the system. Besides playing music, Clementine also includes interesting extra utilities, such as a tag editor, support for online music services like Last.fm and Jamendo, a built-in online radio player and a cover manager that can find missing album covers for you. Clementine doesn’t have as many library management features as we could expect from a music manager, but it\\'s come on in leaps over the last few versions, managing to add extra features - like global hotkeys, sleek interface and good playlist management - while remaining a light, well-designed player that\\'s perfect for those who prefer to stay away from bloatware. Clementine is a lightweight music player with clean design and a bunch of interesting extra tools. Give it a try! Changes In this release Clementine gains a brand new edit tag dialog with autocompletion and the ability to automatically identify music and fetch missing tags from MusicBrainz. CUE sheets are now supported - they are detected automatically when scanning your library and each track will show up separately. We\\'ve made a load of smaller improvements as well such as showing album covers in the Library tab, greying out deleted songs, a \"Show in file browser\" option, support for network proxies, a \"Full library rescan\" option, and a new tooltip for the track slider that helps you seek more accurately to a specific place in a song.'", "title": "'Clementine  1.2.0'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-08-663x535.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-09-645x535.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-10-656x535.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-11-633x535.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-12-542x535.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-13-700x461.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-14-700x479.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-15-692x535.png", "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-16-278x535.png"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-08-663x535.png", "checksum": "0ba88e433d01b6165f7386d1d226d914", "path": "full/f91f8f83383a9b6efe7eb0c77d9aa6214814fb2b.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-09-645x535.png", "checksum": "ab22561b33b6d29dc32e665f04fe16f6", "path": "full/34068af737948281592013602431fb3240953b12.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-10-656x535.png", "checksum": "faed29027549c30931699f5141d313c8", "path": "full/98c503bbee514e97c48998ca9c6685b812c39d1a.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-11-633x535.png", "checksum": "a9a47adbfa7540f6476ace930a15d5af", "path": "full/4ccb6e73d6c98de0ce19983c7ba40a9cc20ad42f.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-12-542x535.png", "checksum": "2c63ba2b1e16b0d72b068f09fa5c46a4", "path": "full/386892854cd796fab5c037c6aa77ec4a1ccfd9c3.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-13-700x461.png", "checksum": "f229214172039beb87b13ebaf6706e82", "path": "full/ec130e65c3622712d46a812cc6b579b90625a68b.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-14-700x479.png", "checksum": "a85a182aca448b91c842178813020dd7", "path": "full/7751498ec65cf27d294e2ff4e5511d3a90f6e10c.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-15-692x535.png", "checksum": "65626456370d4b25d47f17dc88515899", "path": "full/67914c5e04fd217b83c99fe365910f8457496b1e.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/94000/94768/clementine-16-278x535.png", "checksum": "d83a25c0cb1dd51eda54661a88900449", "path": "full/42ea86ad010568bd3930c08d7636b065db0fac7e.jpg"}], "os": "'Windows XP'", "files": []},
{"description": "''", "title": "'Word Search Construction Kit  4.0c'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/35000/35369/word-search-construction-kit-12.jpg", "https://screenshots.en.sftcdn.net/en/scrn/35000/35369/word-search-construction-kit-7.jpg", "https://screenshots.en.sftcdn.net/en/scrn/35000/35369/word-search-construction-kit-6.jpg"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/35000/35369/word-search-construction-kit-12.jpg", "checksum": "8d42af1a82a9afcb6d2c197f36005568", "path": "full/47a20d9e1ef359eb343c53b7fd793b5820bada92.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/35000/35369/word-search-construction-kit-7.jpg", "checksum": "63d692ef6787a1081030c31af67ab204", "path": "full/5f904b701513e853e44e96cae622afa5aea7a76e.jpg"}, {"url": "https://screenshots.en.sftcdn.net/en/scrn/35000/35369/word-search-construction-kit-6.jpg", "checksum": "5a84a3a2020e9be50ea990b6a528a6a2", "path": "full/900fa7756b02d3c526ed78c767cb3e44c691e586.jpg"}], "os": "'Windows 98'", "files": []},
{"description": "\"When it comes to web design, there's only one serious option that most professionals use and that's Adobe Dreamweaver. An all round powerful web design suite Adobe Dreamweaver 2014 is the latest incarnation of this all powerful web design program and doesn’t include big changes but rather many minor improvements that make your daily coding faster and easier. This new version of Adobe Dreamweaver includes new features such as Element Quick View, New editing capabilities in Live View, Live Insert to insert HTML elements directly into the Live View and a new useful Help Center. Like previous versions, Adobe Dreamweaver follows the WYSIWYG (What You See is What You Get) philosophy so you can see exactly what you're doing with every change in code. Alternatively, you can opt for a full code view or if you want your cake and eat it, see both at once in a split view. Inserting elements is a breeze offering you maximum flexibility to drag and drop or insert by code images, video, audio and more. You can easily shift and rearrange these elements until you're happy with the exact layout. There are couple of ready made HTML and CSS style sheets included but you'll need a basic knowledge of CSS and HTML to get going with Dreamweaver. Adobe Dreamweaver is of course seamlessly integrated with the rest of Creative Suite. However, you can't export projects to other applications such as Photoshop and Illustrator for example. Requires Creative Cloud subscription The general interface of Dreamweaver hasn't changed a great deal but it's still very much a tool for professionals. To learn how to use it properly takes many months of learning. In addition, Like all of the Creative Cloud Suite, Adobe Dreamweaver requires an ongoing subscription to Creative Cloud in order to use it. This offers advantages in that you can edit on the move and your work is always synced and backed up to Creative Cloud. The disadvantage is that you are locked into Adobe's Creative Cloud subscription model. Still one of the best on the market Adobe Dreamweaver 2014 is another positive evolution of the web design industry reference tool and will is one of the best design suites out there to help you meet the demands of the next generation of web content. Changes Adobe Dreamweaver CC supports the following formats HTML, XHTML, CSS, XML, JavaScript, Ajax, PHP, Adobe ColdFusion\"", "title": "'Adobe Dreamweaver CC  2017'", "image_urls": ["https://screenshots.en.sftcdn.net/en/scrn/7000/7564/adobe-dreamweaver-cs5-5-6.jpg", "https://screenshots.en.sftcdn.net/en/scrn/7000/7564/adobe-dreamweaver-cs5-5-37.jpg", "https://screenshots.en.sftcdn.net/en/scrn/7000/7564/adobe-dreamweaver-cs5-5-52.jpg", "https://screenshots.en.sftcdn.net/en/scrn/7000/7564/adobe-dreamweaver-cc-16-700x391.jpg"], "images": [{"url": "https://screenshots.en.sftcdn.net/en/scrn/7000/7564/adobe-dreamweaver-cc-16-700x391.jpg", "checksum": "c6f8c8cab4d12651f4b27183933f63ac", "path": "full/a0e1d05f5d16c901da07d86d95868b6a4686b003.jpg"}], "os": "'Windows 7'", "files": []}